<template>
  <h1>故事資料問題</h1>

  <h2>Q：為什麼沒有xx故事資料？為什麼國際服更新後的內容還不存在？</h2>
  <p>
    A：一般情況下，本站的資料應能
    及時跟上日服、國際服的更新速度，在更新後一到兩小時內即可完成同步。然而，由於本站依賴於<b>第三方資料</b>且使用了<b>CDN快取</b>，兩者其一出現
    問題都會導致資料無法及時同步更新。
  </p>
  <p>當遇到資料更新不及時時，以下均有可能為其原因：</p>
  <ul>
    <li>瀏覽器快取未重新整理（PC端按 Ctrl+F5 可強制重新整理）</li>
    <li>
      CloudFlare（主站）/AWS（加速站）快取未重新整理
      <ul>
        <li>
          如您在使用AWS加速站（ba-l10n<b>-aws</b>.cnfast.top），請先訪問<a
            href="https://ba-l10n.cnfast.top/"
            >主站點</a
          >確認情況
        </li>
      </ul>
    </li>
    <li>
      GitHub Actions指令碼未正常執行，或是錯過了執行實際，另見<a href="#when-update">資料更新時間</a
      >一節
    </li>
    <li>第三方資料來源延遲或不可用</li>
  </ul>

  <h2>Q：為什麼找不到xx主線/活動故事？為什麼資料顯示“L10N unmapped”？</h2>
  <p>
    A：與羈絆故事不同，主線/活動故事的原始資料中並未指明相關故事及其名稱、簡潔的本地化資料之關係，因而這些資料均需人工索引。
  </p>
  <p>
    具體而言，主要故事（主線、社團(支線)、短篇、其他）的篇、章名及故事編號、名稱、簡介都需要人工索引，而活動故事則為其名稱與簡介，預設為顯示為“L10N
    unmapped”。
  </p>
  <p>
    在前一種情況下，除非您知道故事編號，否則將無法訪問資料；在後一種情況下，資料可透過正常方式訪問，只是缺少了相關名稱及簡介資訊。
  </p>

  <h2>Q：為什麼有資料為空？為什麼有資料為“LocalizeError”？</h2>
  <p>
    A：對於故事：一些戰鬥後故事，如<RouterLink to="/scenario/21035"
      >遊戲開發部篇第一章第三話（V2C1E3）的戰鬥後故事</RouterLink
    >，其實際有文字的內容僅為下一話故事的預告，即僅 作過渡用。
  </p>
  <p>對於其他：有幾種情況均可能導致資料為空：</p>
  <ul>
    <li>日服與國際服之間，部分資料由於進度差異可能僅有日服資料</li>
    <li>指令碼Bug，可能吞掉了部分資料項</li>
  </ul>
  <p>
    此外，由於本站的主要意圖是為了讓玩家能<b>橫向比較文字差異</b>，因而所有非文字內容均會被濾去，節省資料量。
  </p>
  <p>
    至於部分資料項為“LocalizeError”等值的情況，推測是國際服等進度落後的伺服器為做程式碼相容所進行的資料填充，本身也是無效資料。
  </p>

  <h2>Q：使用機翻時，一般翻譯為什麼語言比較好？</h2>
  <p>A：一般而言，<strong>英語</strong>會是比較通用的選擇。</p>
  <p>
    根據我們的經驗來看，Google翻譯在源語言或目標語言不是英語時，會將英語作為中間語言進行翻譯。換言之，無論是中日還是中韓互譯，內容一定會先翻譯成英語，而後再翻譯到目標語言。
  </p>
  <p>
    考慮到Google翻譯的準確性本身並不怎麼高（除了或許翻譯到英語時），我們建議將英語作為首要考慮語言。
  </p>

  <h2 id="when-update">Q：資料更新時間？</h2>
  <p>A：當前，GitHub Action會在以下時間點檢查資料更新：</p>
  <ul>
    <li>UTC+8 13:00、14:00、15:00、17:00、18:00、20:00</li>
    <li>UTC/GMT 05:00、06:00、07:00、09:00、10:00、12:00</li>
  </ul>
  <p>
    對於先前提到的主線、活動資料，則需資料維護者人工介入進行。你也可以考慮<a href="#be-a-maintainer"
      >成為一名資料維護者</a
    >，直接參與建設與維護。
  </p>

  <h1>人物語音</h1>

  <h2>Q：為什麼SchaleDB的資料中無戰鬥部分？</h2>
  <p>
    A：在很長一段時間裡，諸如學生成長、好感度提升及所有戰鬥語音等都是<b>無字幕</b>的，直到日服三週年過後的幾個月才加入了相關語音字幕，但也僅限於在人物語音頁播放時顯示，而且還面顯示的語音本身也並不是很全。
  </p>
  <p>
    由於SchaleDB至今（2024.11.16）仍未加入對戰鬥部分的語音文字，為了節省資料量，本站在資料處理時專門去掉了該部分資料。
  </p>

  <h2>Q：語音頁中的“語言程式碼”是什麼意思？</h2>
  <p>
    A：本站的語言程式碼可分為三部分：<i>[伺服器簡寫]</i><em><i>[語言程式碼縮寫]</i></em
    ><i>[可選，轉換到的目標語言]</i>。
  </p>
  <ul>
    <li>伺服器簡稱：<code>j</code>，日服；<code>g</code>，國際服；<code>c</code>，國服</li>
    <li>
      語言程式碼簡寫：<code>ja</code>，日語；<code>ko</code>，韓語；<code>en</code>，英語；<code>th</code>，泰語；<code>tw</code>，繁體中文（臺灣地區）；<code>cn</code>，簡
      體中文（中國大陸）
    </li>
    <li>
      轉換到的目標語言：<code>tw</code>，轉換到繁體中文（臺灣地區）用詞與字形；<code>cn</code>，轉換到簡體中文（中國大陸）用詞與字形
    </li>
  </ul>
  <p>
    例如，<code>g_ja</code>表明為“國際服的日語資料”，而<code>g_tw_cn</code>則表明為“由國際服繁體中文轉換到簡體中文的資料”。
  </p>

  <h2>Q：在一般UI中，“進入”“閒置”“退出”是什麼意思？</h2>
  <p>
    A：所謂的“進入”（Enter）、“閒置”（Idle）與“退出”（Exit）其實來源於BA底層對各個語音的編碼命名規則，代表語音觸發的不同狀態。
  </p>
  <p>以任務選單為例，介面及語音的狀態實際會經歷下列變化：</p>
  <ul>
    <li>（從例如遊戲首頁大廳等）進入時，隨即切換阿羅娜/普拉娜的轉檯，然後播放“進入”語音</li>
    <li>播放結束後，進入<em>閒置</em>轉該，此時“閒置”的語音會自動播放</li>
    <li>當與阿羅娜/普拉娜互動時，先切換到<em>退出</em>狀態，播放“退出”語音</li>
    <li>阿羅娜/普拉娜跳到跟前，進入<em>進入</em>狀態，播放“進入”語音</li>
    <li>播放結束後，進入<em>閒置</em>狀態，此時若繼續互動則會播放“閒置”語音</li>
  </ul>
  <p>而對於一般大廳而言：</p>
  <ul>
    <li>從其他介面進入或返回到首頁大廳時，大廳先切換到<em>進入</em>狀態，播放“進入”語音</li>
    <li>播放結束後，進入<em>閒置</em>狀態，此時若繼續互動則會播放“閒置”語音</li>
    <li>
      大多數語音一般都屬於“進入”或“閒置”兩種狀態，因為需要在“退出”時還要播放語音的場景基本不存在。
    </li>
  </ul>

  <h2>Q：在一般/大廳分類下看到的“造型編號”是什麼意思？</h2>
  <p>
    A：部分學生，如美咲、亞津子、紗織、若藻等的大廳中，她們實際上擁有兩套立繪。在資料中，這兩套立繪分別對應了兩套不同的語音；儘管大部分語音檔案及文字完全一致，過程中我們仍發
    現了部分語種的文字不統一的情況，因此我們決定將其保留。
  </p>

  <h2>Q：為什麼語音說明與遊戲內/SchaleDB不同？</h2>
  <p>
    A：儘管遊戲內與SchaleDB的語音圖鑑的確給各個語音做了簡單的說明，但在實踐中我們發現這些說明文字並不準確，容易讓人一頭霧水。
  </p>
  <p>
    例如，SchaleDB中的“編隊”，更準確的寫法應該是“編隊編入”，。對於如“編隊選擇”這種本身難以描述的（使用者的認知更多是“拎起”小人的語音），我們則又額外添加了說明進行解釋。
  </p>

  <h2>Q：阿羅娜/普拉娜語音名稱中的“主角”是什麼意思？</h2>
  <p>
    A：這涉及到BA底層對任務選單中“背景”/“場景”的定義。我們可以從表面行為和語音的底層系統命名方式來回答這個問題。
  </p>
  <p>
    你可能注意到，在阿羅娜、普拉娜一起出現的場景中，有時可能會出現“永遠都喚不起另一個”的情況：例如普拉娜在牆後偷看阿羅娜睡覺的場景中，無論如何點選都無法喚起普拉娜，只能是阿羅。這些場景的一大特點便是背景為天藍色——顯然，是阿羅娜的房間，這就是所謂“主角”身份的含義。
  </p>
  <p>
    從底層資料來說，這一場景的語音被統一命名為 UIWorkCoexist_AronaSleepPeekEnter/Idle/Exit
    ，表明該語音是在兩人“同時出現”（coexist）、“阿羅娜在睡覺”（AronaSleep）、普拉娜在“
    偷看”（Peek）的情況下觸發的。可以看到，在編號中只有“Arona”阿羅娜而無“Plana”普拉娜，自然表明這一場景是阿羅娜的主場，當然是阿羅娜來響應你的請求。
  </p>

  <h2>Q：部分特殊人物的語音</h2>
  <p>A：</p>

  <h2>Q：人物語音中的“活動型別”是什麼意思？有什麼意義？</h2>
  <p>
    A：實踐證明，BA底層將每一輪活動（無論是第一次實裝還是復刻）都視作完全不同的兩個活動。正如夜貓佬的某條動態裡說的一樣，不同的活動的關卡星數會獨立計數。由於這種底層特性，人
    物語音自然也不能免俗。
  </p>
  <p>
    在對資料進行分析時，我們發現部分早期活動中的活動對話進行了多次重譯和回滾，內容並不完全一致；雖然這在目前大多數活動中已經無法見到，但我們認為這是個有趣的發現，因而決定保留
  </p>

  <h1>一般問題</h1>

  <h2>Q：為什麼最高只支援顯示三語（PC）/五語（移動端）？</h2>
  <p>A：對於PC端來說，橫向顯示三語已是一般16:9螢幕的極限，再增多語種毫無意義。</p>
  <p>
    至於為什麼最高僅支援五語，則是因為BA除國服外只支援五種語言（國服沒有資料）；同時，如上文所述，過多的語言沒有意義。
  </p>
  <p>然而，如您確實需要獲取全部語言的本地化資料，您應考慮直接解析JSON或匯出CSV（開發中）。</p>

  <h2 id="be-a-maintainer">Q：我想成為一名資料維護者！</h2>
  <p>A：欲成為一名資料維護者，你應該至少擁有以下經驗：</p>
  <ul>
    <li>基礎Python程式設計能力（能debug最好）</li>
    <li>JSON基礎語法</li>
    <li>至少一種主流程式碼編輯器的基礎使用能力</li>
    <li>日語（<strong>非必要</strong>，只是這樣愛更新本地化索引時會更方便）</li>
    <li>能夠正常訪問與使用GitHub</li>
  </ul>
  <p>
    然後，請透過<RouterLink to="/about">關於頁</RouterLink
    >上的聯絡方式聯絡。我們會簡單徐文你的情況，介紹具體的安排與情況。
  </p>

  <h2 id="report-bug">Q：我發現了Bug！</h2>
  <p>
    A：請到專案的<a href="https://github.com/orgs/BA-L10N-Viewer/discussions">討論版</a
    >上報告問題。報告時，請提供：
  </p>
  <ul>
    <li>何處發生？（完整URL）</li>
    <li>能否復現？復現步驟？</li>
    <li>如何影響體驗？</li>
    <li>
      其他資訊（可選，這將允許我們能夠追蹤到您的訪問session）
      <ul>
        <li>訪問時間</li>
        <li>使用的瀏覽器及其版本</li>
      </ul>
    </li>
  </ul>
</template>
<script setup lang="ts"></script>
