<template>
    <h1>為什麼有這個專案</h1>
  
    <h2>BALV的前前前世</h2>
    <p>最初有類似BALV的想法要追溯到2023年6月。彼時的我開了小號，打算一邊美服備戰二週年一邊看英文劇情積累詞彙。相較於繁中，英文版不僅大改句子變得簡潔不少，而且還用了很多專業與比較生僻的詞，讀起來很吃力。於是當時我就想，如果有工具能兩邊對照著看就好了。</p>
    <p>由於當時沒接觸到解包，加上當時也不關心（和沒意識到）BA的文字對錯與質量，這個想法最後被擱置了。不過主要還是因為當時我很喜歡BA的音樂，於是整了一個叫BA OST Index的專案，基於Jinja的靜態網站——但因為後續維護與功能更新體量過大，我個人也就逐漸不再維護了。</p>
    <p>入坑幾個月的時候，我是覺得繁中翻譯沒什麼問題的，不過在經歷了相當多的一些譯法爭討論後，我開始改變看法。2024年5月，百鬼夜行主線實裝，在推特上，英文區的使用者首次罕見的聯合起來，把Nexon的本地化團隊吊著打，之後也一直如此，直到現在。由於BA OST Index我已無心維護，所以BALV的這個想法自然就又回到了我的思緒裡。</p>
    <p>2024年6月，我開始著手BALV的前期開發準備工作，確認功能及架構等。7月～8月，BALV進入基礎功能開發。9月，BALV正式上線beta版。目前，BALV正在進行UI重構及新功能的新增，為使用者提供更好體驗。</p>
  
    <h2>逆天的本地化文本</h2>
    <p>相較於上文中提到的英文區，作為母語為中文的我們簡直可謂為活在天堂。至少在翻譯上，劇情上我們有威威字幕君等團隊和個人，二創也有無數烤肉組與單幹的散戶，而且質量都很不錯；應當說，BA有一個這樣的社群是我們中文區玩家的福氣。根據我觀察的來看，英文區這邊雖確實也有幾位扛把子的，但似乎都是單幹，少見有團隊氣候。</p>
    <p>國服簡中與國際服繁中的情況這裡就不多介紹了，總結來說就是一個是和諧，一個是翻譯“還算可以”的地步。據說繁中還是經過幾次大概並切到了日語為原文翻譯的，只能說很幸運了。</p>
    <p>英文區其實一直以來都被NX的本地化搞得很不爽，因為除了明顯的翻譯錯誤外，英文區翻譯還加入了些許Reddit俚語爛梗，甚至不明所以地改掉一大段句子（尤見於部分大廳語音，特別是對老師有明顯表白、性暗示的）或加一些完全子虛烏有的東西。自2024年5月國際服百鬼夜行主線實裝以來，部分日、韓玩家就一直與英文區玩家聯手，不僅將其中的翻譯一一指出並做成一圖流等形式方便傳播，還號召廣大玩家去英文區官號底下留言並衝塔Nexon的客服中心，最終讓許多翻譯問題得到了解決與修正。</p>
    <p>BALV與其他存在或仍在開發的遊戲內文字檢視器不同，它於一開始就對多語言文字的對比與機翻翻譯作了特別支援，這一方面是為了滿足像我這種語言學習者和好奇寶寶，另一方面也是為了幫助以上這種特殊的情況，使人人都可參與其中並簡化對比流程。</p>

    <PvMessage severity="info">不過，值得指出的是，最近（11月底）推特使用者<a href="https://x.com/TL2TJ">TL2TJ</a>在網上釋出了自己的一個針對國際版的小Mod，其針對性的修改了遊戲內的本地化內容資料庫，並且目前已獲得多個社群翻譯及逆向大佬的幫助。<br />
    所以……可以說BALV剛一出場就輸了吧，不過我們的另一點初心卻並沒有改變：那就是，為全部BA玩家提供一個快速、簡單、便捷的遊戲內文字檢視服務。<br />
    總而言之，希望你閱讀愉快！</PvMessage>
  
    <h2>日、韓文字之爭</h2>
    <p>眾所周知，BA是一款由韓國NEXON Games開發的遊戲。而又眾所周知的是，日服因為比國際服先開，所以日服比國際服進度要快。還眾所周知的是，日方運營Yostar會對文字進行潤色。</p>
    <p>以上事實體現出三點情況：一，遊戲的原始語言是韓文；二，日服內容會成為玩家重要的一手資源，甚至會成為玩家認可的“唯一官方版本”；三，韓、日文文字並不完全一致。</p>
    <p>看上去沒什麼問題，對吧？</p>
    <p>大錯特錯。如果你關注一些做BA劇情解析的UP主，那麼底下評論區裡提到日韓文文字之間異同的評論應該你也見多了。照理來說，因為日服在前，因此國際服理應最好對照日語來翻——你大概已經猜出來了：沒錯！除了繁中外，目前英、泰文其實都是按韓文來翻譯的！</p>
    <p>這種源語言的差異會導致一些很抽象的問題。在一開始的時候，大家都是參照的日服文字，結果就導致了有很多對不上的；後來，有懂韓文的老哥表示，這其中很多所謂的“翻譯問題”純粹是因為對的是日文，從韓文的角度看並沒有太大問題。</p>
    <p>由於日、韓文之間的明顯差異，有一些玩家也認為國服簡中翻譯是基於韓文文字翻譯的，這點我無法確認。</p>
    <p>造成日、韓文文字差異的原因很簡單：語言與文化差異。從結果看，BA日服在翻譯時採用了“異化翻譯”，即將文字改為更符合當地語言習慣和認知的形式，並且還對譯文進行了修改與潤色（並可能同時部分拯救了V1C3中星野的形象）。雖說也是改，但至少不是像英文區那樣離經叛道和瞎雞兒亂改，不過就算這樣也足以造成兩個文字之間的差異。</p>
    
    <h2>現在，又如何呢？</h2>
    <p>對於中文區的玩家來說，BA國服簡中和國際服繁中的本地化已經夠用，再不濟還有一整個社群兜底呢，因而無需也沒有必要去衝Nexon，畢竟人不多Nexon也不會重視。而且考慮到Nexon特意為了迎合市場，把繁中都專門切到日文翻了，只能說是給足面子了。</p>
    <p>對於英文區的玩家來說，我的評價是務必加大力度。作為玩家，也作為一個業餘的半吊子中英翻譯，我認為讓全體玩家享受原汁原味、極少量或不妥協的本地化內容是每個本地化團隊的任務與使命。對於Nexon這種不放在心上、不投入足量資金的行為，我個人表示不認可與譴責。</p>
    <p>不過，如今逼迫官方做出改動或許也不是必要的了。由於推特上的<a href="https://x.com/TL2TJ">TL2TJ</a>大佬的貢獻及社群翻譯人的加入，BA英文區的本地化問題正逐漸透過Mod（覆蓋遊戲原檔案）的形式逐步改善和消除。可以說本站的作用因此已不再那麼顯著，但我們仍然在這裡表明態度：</p>
    <p><strong>唯當人人都可參與糾錯的過程中時，本地化中的問題才能被一一解決</strong>——BALV為此而來，也為此而努力。</p>
</template>

<script setup lang="ts">
import PvMessage from 'primevue/message'
</script>