<template>
  <h1>故事数据问题</h1>

  <h2>Q：为什么没有xx故事数据？为什么国际服更新后的内容还不存在？</h2>
  <p>
    A：一般情况下，本站的数据应能
    及时跟上日服、国际服的更新速度，在更新后一到两小时内即可完成同步。然而，由于本站依赖于<b>第三方数据</b>且使用了<b>CDN缓存</b>，两者其一出现问题都会导致数据无法及时同步更新。
  </p>
  <p>当遇到数据更新不及时时，以下均有可能为其原因：</p>
  <ul class="ul-compact">
    <li>浏览器缓存未刷新（PC端按 Ctrl+F5 可强制刷新）</li>
    <li>
      CloudFlare（主站）/AWS（加速站）缓存未刷新
      <ul class="ul-compact">
        <li>
          如您在使用AWS加速站（ba-l10n<b>-aws</b>.cnfast.top），请先访问<a
            href="https://ba-l10n.cnfast.top/"
            >主站点</a
          >确认情况
        </li>
      </ul>
    </li>
    <li>
      GitHub Actions脚本未正常运行，或是错过了运行实际，另见<a href="#when-update">数据更新时间</a
      >一节
    </li>
    <li>第三方数据源延迟或不可用</li>
  </ul>

  <h2>Q：为什么找不到xx主线/活动故事？为什么数据显示“L10N unmapped”？</h2>
  <p>
    A：与羁绊故事不同，主线/活动故事的原始数据中并未指明相关故事及其名称、简洁的本地化数据之关系，因而这些数据均需人工索引。
  </p>
  <p>
    具体而言，主要故事（主线、社团(支线)、短篇、其他）的篇、章名及故事编号、名称、简介都需要人工索引，而活动故事则为其名称与简介，默认为显示为“L10N
    unmapped”。
  </p>
  <p>
    在前一种情况下，除非您知道故事编号，否则将无法访问数据；在后一种情况下，数据可通过正常方式访问，只是缺少了相关名称及简介信息。
  </p>

  <h2>Q：为什么有数据为空？为什么有数据为“LocalizeError”？</h2>
  <p>
    A：对于故事：一些战斗后故事，如<RouterLink to="/scenario/21035"
      >游戏开发部篇第一章第三话（V2C1E3）的战斗后故事</RouterLink
    >，其实际有文本的内容仅为下一话故事的预告，即仅作过渡用。
  </p>
  <p>对于其他：有几种情况均可能导致数据为空：</p>
  <ul class="ul-compact">
    <li>日服与国际服之间，部分数据由于进度差异可能仅有日服数据</li>
    <li>脚本Bug，可能吞掉了部分数据项</li>
  </ul>
  <p>
    此外，由于本站的主要意图是为了让玩家能<b>横向比较文本差异</b>，因而所有非文本内容均会被滤去，节省数据量。
  </p>
  <p>
    至于部分数据项为“LocalizeError”等值的情况，推测是国际服等进度落后的服务器为做代码兼容所进行的数据填充，本身也是无效数据。
  </p>

  <h2>Q：使用机翻时，一般翻译为什么语言比较好？</h2>
  <p>A：一般而言，<strong>英语</strong>会是比较通用的选择。</p>
  <p>
    根据我们的经验来看，Google翻译在源语言或目标语言不是英语时，会将英语作为中间语言进行翻译。换言之，无论是中日还是中韩互译，内容一定会先翻译成英语，而后再翻译到目标语言。
  </p>
  <p>
    考虑到Google翻译的准确性本身并不怎么高（除了或许翻译到英语时），我们建议将英语作为首要考虑语言。
  </p>

  <h2 id="when-update">Q：数据更新时间？</h2>
  <p>A：当前，GitHub Action会在以下时间点检查数据更新：</p>
  <ul class="ul-compact">
    <li>UTC+8 13:00、14:00、15:00、17:00、18:00、20:00</li>
    <li>UTC/GMT 05:00、06:00、07:00、09:00、10:00、12:00</li>
  </ul>
  <p>
    对于先前提到的主线、活动数据，则需数据维护者人工介入进行。你也可以考虑<a href="#be-a-maintainer"
      >成为一名数据维护者</a
    >，直接参与建设与维护。
  </p>

  <h1>人物语音</h1>

  <h2>Q：为什么SchaleDB的数据中无战斗部分？</h2>
  <p>
    A：在很长一段时间里，诸如学生成长、好感度提升及所有战斗语音等都是<b>无字幕</b>的，直到日服三周年过后的几个月才加入了相关语音字幕，但也仅限于在人物语音页播放时显示，而且还页面显示的语音本身也并不是很全。
  </p>
  <p>
    由于SchaleDB至今（2024.11.16）仍未加入对战斗部分的语音文本，为了节省数据量，本站在数据处理时专门去掉了该部分数据。
  </p>

  <h2>Q：语音页中的“语言代码”是什么意思？</h2>
  <p>
    A：本站的语言代码可分为三部分：<i>[服务器简写]</i><em><i>[语言代码缩写]</i></em
    ><i>[可选，转换到的目标语言]</i>。
  </p>
  <ul class="ul-compact">
    <li>服务器简称：<code>j</code>，日服；<code>g</code>，国际服；<code>c</code>，国服</li>
    <li>
      语言代码简写：<code>ja</code>，日语；<code>ko</code>，韩语；<code>en</code>，英语；<code>th</code>，泰语；<code>tw</code>，繁体中文（台湾地区）；<code>cn</code>，简体中文（中国大陆）
    </li>
    <li>
      转换到的目标语言：<code>tw</code>，转换到繁体中文（台湾地区）用词与字形；<code>cn</code>，转换到简体中文（中国大陆）用词与字形
    </li>
  </ul>
  <p>
    例如，<code>g_ja</code>表明为“国际服的日语数据”，而<code>g_tw_cn</code>则表明为“由国际服繁体中文转换到简体中文的数据”。
  </p>

  <h2>Q：在一般UI中，“进入”“闲置”“退出”是什么意思？</h2>
  <p>
    A：所谓的“进入”（Enter）、“闲置”（Idle）与“退出”（Exit）其实来源于BA底层对各个语音的编码命名规则，代表语音触发的不同状态。
  </p>
  <p>以任务菜单为例，界面及语音的状态实际会经历下列变化：</p>
  <ul class="ul-compact">
    <li>（从例如游戏首页大厅等）进入时，随即切换阿罗娜/普拉娜的转台，然后播放“进入”语音</li>
    <li>播放结束后，进入<em>闲置</em>转该，此时“闲置”的语音会自动播放</li>
    <li>当与阿罗娜/普拉娜互动时，先切换到<em>退出</em>状态，播放“退出”语音</li>
    <li>阿罗娜/普拉娜跳到跟前，进入<em>进入</em>状态，播放“进入”语音</li>
    <li>播放结束后，进入<em>闲置</em>状态，此时若继续互动则会播放“闲置”语音</li>
  </ul>
  <p>而对于一般大厅而言：</p>
  <ul class="ul-compact">
    <li>从其他界面进入或返回到首页大厅时，大厅先切换到<em>进入</em>状态，播放“进入”语音</li>
    <li>播放结束后，进入<em>闲置</em>状态，此时若继续互动则会播放“闲置”语音</li>
    <li>
      大多数语音一般都属于“进入”或“闲置”两种状态，因为需要在“退出”时还要播放语音的场景基本不存在。
    </li>
  </ul>

  <h2>Q：在一般/大厅分类下看到的“造型编号”是什么意思？</h2>
  <p>
    A：部分学生，如美咲、亚津子、纱织、若藻等的大厅中，她们实际上拥有两套立绘。在数据中，这两套立绘分别对应了两套不同的语音；尽管大部分语音文件及文本完全一致，过程中我们仍发现了部分语种的文本不统一的情况，因此我们决定将其保留。
  </p>

  <h2>Q：为什么语音说明与游戏内/SchaleDB不同？</h2>
  <p>
    A：尽管游戏内与SchaleDB的语音图鉴的确给各个语音做了简单的说明，但在实践中我们发现这些说明文本并不准确，容易让人一头雾水。
  </p>
  <p>
    例如，SchaleDB中的“编队”，更准确的写法应该是“编队编入”，。对于如“编队选择”这种本身难以描述的（用户的认知更多是“拎起”小人的语音），我们则又额外添加了说明进行解释。
  </p>

  <h2>Q：阿罗娜/普拉娜语音名称中的“主角”是什么意思？</h2>
  <p>
    A：这涉及到BA底层对任务菜单中“背景”/“场景”的定义。我们可以从表面行为和语音的底层系统命名方式来回答这个问题。
  </p>
  <p>
    你可能注意到，在阿罗娜、普拉娜一起出现的场景中，有时可能会出现“永远都唤不起另一个”的情况：例如普拉娜在墙后偷看阿罗娜睡觉的场景中，无论如何点击都无法唤起普拉娜，只能是阿罗娜。这些场景的一大特点便是背景为天蓝色——显然，是阿罗娜的房间，这就是所谓“主角”身份的含义。
  </p>
  <p>
    从底层数据来说，这一场景的语音被统一命名为 UIWorkCoexist_AronaSleepPeekEnter/Idle/Exit
    ，表明该语音是在两人“同时出现”（coexist）、“阿罗娜在睡觉”（AronaSleep）、普拉娜在“偷看”（Peek）的情况下触发的。可以看到，在编号中只有“Arona”阿罗娜而无“Plana”普拉娜，自然表明这一场景是阿罗娜的主场，当然是阿罗娜来响应你的请求。
  </p>

  <h2>Q：部分特殊人物的语音</h2>
  <p>A：</p>

  <h2>Q：人物语音中的“活动类型”是什么意思？有什么意义？</h2>
  <p>
    A：实践证明，BA底层将每一轮活动（无论是第一次实装还是复刻）都视作完全不同的两个活动。正如夜猫佬的某条动态里说的一样，不同的活动的关卡星数会独立计数。由于这种底层特性，人物语音自然也不能免俗。
  </p>
  <p>
    在对数据进行分析时，我们发现部分早期活动中的活动对话进行了多次重译和回滚，内容并不完全一致；虽然这在目前大多数活动中已经无法见到，但我们认为这是个有趣的发现，因而决定保留。
  </p>

  <h1>一般问题</h1>

  <h2>Q：为什么最高只支持显示三语（PC）/五语（移动端）？</h2>
  <p>A：对于PC端来说，横向显示三语已是一般16:9屏幕的极限，再增多语种毫无意义。</p>
  <p>
    至于为什么最高仅支持五语，则是因为BA除国服外只支持五种语言（国服没有数据）；同时，如上文所述，过多的语言没有意义。
  </p>
  <p>然而，如您确实需要获取全部语言的本地化数据，您应考虑直接解析JSON或导出CSV（开发中）。</p>

  <h2 id="be-a-maintainer">Q：我想成为一名数据维护者！</h2>
  <p>A：欲成为一名数据维护者，你应该至少拥有以下经验：</p>
  <ul class="ul-compact">
    <li>基础Python编程能力（能debug最好）</li>
    <li>JSON基础语法</li>
    <li>至少一种主流代码编辑器的基础使用能力</li>
    <li>日语（<strong>非必要</strong>，只是这样爱更新本地化索引时会更方便）</li>
    <li>能够正常访问与使用GitHub</li>
  </ul>
  <p>
    然后，请通过<RouterLink to="/about">关于页</RouterLink
    >上的联系方式联系。我们会简单徐文你的情况，介绍具体的安排与情况。
  </p>

  <h2 id="report-bug">Q：我发现了Bug！</h2>
  <p>
    A：请到项目的<a href="https://github.com/orgs/BA-L10N-Viewer/discussions">讨论版</a
    >上报告问题。报告时，请提供：
  </p>
  <ul class="ul-compact">
    <li>何处发生？（完整URL）</li>
    <li>能否复现？复现步骤？</li>
    <li>如何影响体验？</li>
    <li>
      其他信息（可选，这将允许我们能够追踪到您的访问session）
      <ul class="ul-compact">
        <li>访问时间</li>
        <li>使用的浏览器及其版本</li>
      </ul>
    </li>
  </ul>
</template>
<script setup lang="ts"></script>
