<script setup lang="ts">

</script>

<template>
  <h1 class="view-h1">FAQ/常见问题</h1>
  <h2>为什么找不到xx故事？</h2>
  <p>本站数据理论上是覆盖所有游戏内故事的，您可直接通过 <code>/scenario/<i>[故事ID]</i></code> 的形式直接进行访问。</p>
  <p>如您是通过搜索功能查找故事的，则表明该故事暂未被索引。您可在项目的这一<a href="https://github.com/orgs/BA-L10N-Viewer/discussions/1">讨论帖子</a>中向开发者说明情况<del>并催更</del>。</p>
  <h2>为什么数据会有延迟？</h2>
  <p>尽管本站后端在一开始确实按照“最大化自动脚本”的方向实现，但实践中发现很多内容仍需人工介入，如不人工介入则可能导致数据错误，于是最终放弃了使用GitHub Action等自动化CI/CD工具的想法。</p>
  <p>本站开发者是<b>2025届高考生</b>，写作本文时已进入高三复习阶段。由于学校周末仅有半天时间，故可能出现数据严重滞后的情况。您可以<b>在上方的讨论帖中留言提醒</b>，或是<b>考虑成为一名数据维护者</b>（请先通过项目讨论版联系）。</p>
  <h2>为什么部分故事是空白的？</h2>
  <p>游戏中的故事展现形式多样，但因为本站的主要意图为<b>供玩家横向比较本地化文本</b>，因而在数据处理中过滤掉了没有本地化文本的纯脚本部分。</p>
  <p>部分主线故事，如<RouterLink to="/scenario/21035">游戏开发部篇第一章第三话的战斗后故事</RouterLink>，脚本处理后仅保留了“下一话”的显示内容。这是因为这一故事并不具备实际文本/对话内容，其作用仅仅是描述了结束故事的动画应如何呈现。</p>
  <h2 id="bug-report">数据有误！网站工作不正常！</h2>
  <p>请在GitHub讨论版的<a href="https://github.com/orgs/BA-L10N-Viewer/discussions/categories/bug-%E6%95%B0%E6%8D%AE%E9%94%99%E8%AF%AF%E5%9B%9E%E6%8A%A5">此分类</a>下发帖告知。告知时请提供：</p>
  <ul>
    <li>错误的具体位置（链接等）</li>
    <li>网站截图</li>
    <li>复现方法</li>
    <li>访问时间（非必要）</li>
  </ul>
  <p>如遭遇技术问题（排版错位/功能交互异常），除了以上的必要内容外，您还可以选择同时报告以下信息：</p>
  <ul>
    <li>浏览器版本</li>
    <li>访问时间</li>
  </ul>
  <p>提交以上信息可协助我们通过Microsoft Clarity具体定位到您的访问会话并观察您的访问行为，进而帮助我们更好定位问题。</p>
</template>

<style scoped>

</style>